Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType
The type of analytical segment.
Since:
2024
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.SourceEquipment
The source equipment (e.g., chiller, boiler, etc.)

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.Loss
The terminal loss (e.g., radiator, coil, etc.)

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.Pump
The segment is pump.

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.Fitting
The segment is fitting.

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.Segment
The segment is undefined.

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegmentType.Undefined
The segment is undefined.